# (c) TheLx0980

class ChatMSG(object):

      # Start text
      START_TXT = """
नमस्ते {}
      
मेरा नाम रॉक्सन है, मेरे बारे में और जानने के लिए नीचे दिए हुए मदद बटन पर दबाए| 
      """
      
      #help text
      HELP_TXT = """
help message 

@lx0980AI
"""

      ABOUT_TXT = """
About me function 
"""
      NOT_FOUND_TXT = """
आपके चैनल के लिए कोई कैप्शन नही मिला डेटाबेस में

<b>चैनल नाम:</b> {}
<b>चैनल आईडी:</b> <code>{}</code>
"""
      
      CAPTION_TXT = """
स्वचालित कैप्शन के लिए आदेश।

<code>/set_caption</code> - इस आदेश से अपने चैनल के लिए कैप्शन तय करें, जिसे आप अपने चैनल में आने वाले मीडिया कैप्टन में संपादित करना चाहते हैं।
<b>उदाहरण:</b> /set_caption -100(चैनल_आईडी)::(आपका कैप्शन) आईडी और कैप्शन को इससे :: अलग करें।
<b>जैसे:</b> /set_caption -1001906731426::@Lx0980AI आने वालेवाले

<code>/update_caption</code> - इस आदेश की मदत से आप अपने चैनल में पहले से तय किए हुए कैप्शन को संपादित कर सकते है।
<b>जैसे:</b> <code>/update_caption (चैनल आईडी)::(कैप्शन)</code>

<code>/caption</code> - इस आदेश की मदद से आप अपने चैनल के वर्तमान के कैप्शन को चेक कर सकते हैं
<b>जैसे:</b> <code>/caption - (चैनल आईडी)</code> 
<b>सूचना</b> चैनल आईडी के शुरू में  "<code>-100</code>" लगाना न भूलें।

<code>/delete_caption</code> - इस आदेश की मदद से आप अपने चैनल के कैप्शन को डिलीट कर सकते हैं।
<b>जैसे:</b> <code>/delete_caption (चैनल आईडी)</code>

@Lx0980AI
"""
