# (c) TheLx0980

class ChatMSG(object):

      # Start text
      START_TXT = """
नमस्ते {}
      
मेरा नाम रॉक्सन है, मेरे बारे में और जानने के लिए नीचे दिए हुए मदद बटन पर दबाए| 
      """
      
      #help text
      HELP_TXT = """
help message 

@lx0980AI
"""

      ABOUT_TXT = """
About me function 
"""
      NOT_FOUND_TXT = """
आपके चैनल के लिए कोई कैप्शन नही मिला डेटाबेस में

<b>चैनल नाम:</b> {}
<b>चैनल आईडी:</b> <code>{}</code>
"""
      
      CAPTION_TXT = """
स्वचालित कैप्शन के लिए आदेश।

/set_caption - इस आदेश से अपने चैनल के लिए कैप्शन तय करें, जिसे आप अपने चैनल में आने वाले मीडिया कैप्टन में संपादित करना चाहते हैं।
उदाहरण: /set_caption -100(चैनल_आईडी)::(आपका कैप्शन) आईडी और कैप्शन को इससे :: अलग करें।
जैसे: /set_caption -1001906731426::@Lx0980AI आने वाले
